app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "created_at", "rating", "resort_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hehe"], ["created_at", Thu, 08 Nov 2012 03:15:36 UTC +00:00], ["rating", 3], ["resort_id", 5], ["updated_at", Thu, 08 Nov 2012 03:15:36 UTC +00:00]]
---
  <p><strong>
    Posted <%= time_ago_in_words(comment.created_at) %>