app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "resorts"
---
  def index
    @total_resorts = Resort.count