app/controllers/comments_controller.rb

SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "rating", "resort_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "good"], ["created_at", Thu, 08 Nov 2012 02:30:38 UTC +00:00], ["rating", 3], ["resort_id", 1], ["updated_at", Thu, 08 Nov 2012 02:30:38 UTC +00:00]]
---
  def create
#    @comment = Comment.new(params[:comment])
    @resort = Resort.find(params[:resort_id])
    @comment = @resort.comments.create!(params[:comment])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @comment = Comment.find(params[:id])