app/controllers/resorts_controller.rb

SELECT "resorts".* FROM "resorts"
---
  def index
    @resorts = Resort.all

SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @resort = Resort.find(params[:id])

SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @resort = Resort.find(params[:id])

INSERT INTO "resorts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Albuquerque"], ["created_at", Thu, 08 Nov 2012 02:22:33 UTC +00:00], ["title", "Sandia Peak"], ["updated_at", Thu, 08 Nov 2012 02:22:33 UTC +00:00]]
---
  def create
    @resort = Resort.new(params[:resort])

    respond_to do |format|
      if @resort.save

SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @resort = Resort.find(params[:id])

SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "resorts" WHERE "resorts"."id" = ?  [["id", 3]]
---
  def destroy
    @resort = Resort.find(params[:id])
    @resort.destroy