app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "name" = 'sam', "password_digest" = '$2a$10$0C/Q5dgau4NnD.WlYSXcGugFsI.tcay87kKN2d.5I1xvK8EDPLPyu', "updated_at" = '2012-11-08 03:54:23.412203' WHERE "users"."id" = 980190962